&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НомерЗП = 1;
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияНА(Команда)
	АвторизацияНАНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияНАвППВычеты(Команда)
	РегистрацияНАвППВычетыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапросНаПередачуНалоговогоВычетаИнвестицииТипА(Команда)
	СтруктураОтвет = ЗапросНаПередачуНалоговогоВычетаИнвестицииТипАНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапросНаПередачуНалоговогоВычетаИнвестицииТипБ(Команда)
	ЗапросНаПередачуНалоговогоВычетаИнвестицииТипБНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСтатусаОбработкиЗапросаНаНалоговыйВычет(Команда)
	ПолучениеСтатусаОбработкиЗапросаНаНалоговыйВычетНаСервере();
КонецПроцедуры

&НаСервере
Процедура АвторизацияНАНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	Результат = Обр.АвторизацияНА(Отладка, НомерЗП);
	
	Если Результат.Отладка Тогда 	
		Сообщить(Результат.AccessTokenStruct.AccessToken);
		Сообщить(Результат.AccessTokenStruct.AccessTokenBase64);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РегистрацияНАвППВычетыНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	Результат = Обр.РегистрацияНАвППВычеты(Отладка, НомерЗП, СместитьВремя);
	
	Если Отладка Тогда 
		Для Каждого Header Из Результат.Headers Цикл 
			Сообщить(СтрШаблон("%1 : %2", Header.Ключ, Header.Значение));	
		КонецЦикла;
		Сообщить(Результат.Body);
	Иначе 
		Сообщить(Результат.Status);
		Если Результат.Свойство("Error") 
			И ТипЗнч(Результат.Error) = Тип("Структура") Тогда 
			Сообщить(Результат.Error.code);
			Сообщить(Результат.Error.message);
			Если ТипЗнч(Результат.Error.additionalInfo) = Тип("Структура") 
				И Результат.Error.additionalInfo.Свойство("EXPECTED_MESSAGE_NUMBER") Тогда 
				НомерЗП = Результат.Error.additionalInfo.EXPECTED_MESSAGE_NUMBER;
			КонецЕсли;
		КонецЕсли;
		Если Результат.Свойство("requestId") Тогда 
			Сообщить(Результат.requestId);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗапросНаПередачуНалоговогоВычетаИнвестицииТипАНаСервере()
	
	СведенияФЛ = Новый Структура;
	СведенияФЛ.Вставить("НомерСвед",			"1112223335");
	СведенияФЛ.Вставить("Фамилия",				"Тестов");
	СведенияФЛ.Вставить("Имя",					"Тест");
	СведенияФЛ.Вставить("Отчество",				"Тестович");
	СведенияФЛ.Вставить("ДатаРожд",				"01.01.1901");
	СведенияФЛ.Вставить("ИННФЛ",				"777777777777");
	СведенияФЛ.Вставить("КодВидДок",			"21");
	СведенияФЛ.Вставить("СерНомДок",			"7777111111");
	
	СведенияФЛ.Вставить("ДатаДог",				"01.01.2001");
	СведенияФЛ.Вставить("НомДог",				"ДУ-ИИС-01012001");
	СведенияФЛ.Вставить("ДатаОткИИС",			"15.01.2001");
	СведенияФЛ.Вставить("СтатИИС",				"1");
	
	СведенияФЛ.Вставить("Период",				"2020");
	СведенияФЛ.Вставить("НалТО",				"1");
	СведенияФЛ.Вставить("ОборотФонд",			"657421,37");
	СведенияФЛ.Вставить("ОборотВнебирж",		"0");
	МассиВСуммДС = Новый Массив;
	МассиВСуммДС.Добавить(Новый Структура("ДатаВнДС, СуммаДС", "01.02.2020", "100000"));
	МассиВСуммДС.Добавить(Новый Структура("ДатаВнДС, СуммаДС", "01.03.2020", "100000"));
	МассиВСуммДС.Добавить(Новый Структура("ДатаВнДС, СуммаДС", "01.04.2020", "100000"));
	МассиВСуммДС.Добавить(Новый Структура("ДатаВнДС, СуммаДС", "01.05.2020", "100000"));	
	СведенияФЛ.Вставить("ОбщСумДСИИС",			МассиВСуммДС);
	
	Обр = РеквизитФормыВЗначение("Объект");
	Результат = Обр.ЗапросНаПередачуНалоговогоВычетаИнвестицииТипА(Отладка, СведенияФЛ);
	
	Если Отладка Тогда 
		Для Каждого Header Из Результат.Headers Цикл 
			Сообщить(СтрШаблон("%1 : %2", Header.Ключ, Header.Значение));	
		КонецЦикла;
		Сообщить(Результат.Body);
		//Сообщить(Результат.XMLText);
		Сообщить(Результат.XMLPath);
		Сообщить(Результат.SingPath);
	Иначе 
		Сообщить(Результат.Status);
		Если Результат.Свойство("Error") 
			И ТипЗнч(Результат.Error) = Тип("Структура") Тогда 
			Сообщить(Результат.Error.code);
			Сообщить(Результат.Error.message);
			Сообщить(Результат.Error.additionalInfo.REASON);
		КонецЕсли;
		Если Результат.Свойство("requestId") Тогда 
			Сообщить(Результат.requestId);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗапросНаПередачуНалоговогоВычетаИнвестицииТипБНаСервере()
	
	СведенияФЛ = Новый Структура;
	СведенияФЛ.Вставить("НомерСвед",			"5552223334");
	СведенияФЛ.Вставить("Фамилия",				"Тестов");
	СведенияФЛ.Вставить("Имя",					"Тест");
	СведенияФЛ.Вставить("Отчество",				"Тестович");
	СведенияФЛ.Вставить("ДатаРожд",				"01.01.1901");
	СведенияФЛ.Вставить("ИННФЛ",				"997777777777");
	СведенияФЛ.Вставить("КодВидДок",			"21");
	СведенияФЛ.Вставить("СерНомДок",			"9977111111");
	
	СведенияФЛ.Вставить("ДатаДог",				"01.01.2010");
	СведенияФЛ.Вставить("НомДог",				"ДУ-ИИС-01012010");
	СведенияФЛ.Вставить("ДатаОткИИС",			"15.01.2010");
	СведенияФЛ.Вставить("СтатИИС",				"1");
		
	Обр = РеквизитФормыВЗначение("Объект");
	Результат = Обр.ЗапросНаПередачуНалоговогоВычетаИнвестицииТипБ(Отладка, СведенияФЛ);
	
	Если Отладка Тогда 
		Для Каждого Header Из Результат.Headers Цикл 
			Сообщить(СтрШаблон("%1 : %2", Header.Ключ, Header.Значение));	
		КонецЦикла;
		Сообщить(Результат.Body);
	Иначе 
		Сообщить(Результат.Status);
		Если Результат.Свойство("Error") 
			И ТипЗнч(Результат.Error) = Тип("Структура") Тогда 
			Сообщить(Результат.Error.code);
			Сообщить(Результат.Error.message);
			Сообщить(Результат.Error.additionalInfo.REASON);			
		КонецЕсли;
		Если Результат.Свойство("requestId") Тогда 
			Сообщить(Результат.requestId);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеСтатусаОбработкиЗапросаНаНалоговыйВычетНаСервере()

	Обр = РеквизитФормыВЗначение("Объект");
	Результат = Обр.ПолучениеСтатусаОбработкиЗапросаНаНалоговыйВычет(Отладка, requestId);
	
	Если Отладка Тогда 
		Для Каждого Header Из Результат.Headers Цикл 
			Сообщить(СтрШаблон("%1 : %2", Header.Ключ, Header.Значение));	
		КонецЦикла;
		Сообщить(Результат.Address);
	Иначе 
		Сообщить(Результат.Status);
		Если Результат.Свойство("Error") 
			И ТипЗнч(Результат.Error) = Тип("Структура") Тогда 
			Сообщить(Результат.Error.code);
			Сообщить(Результат.Error.message);
			Сообщить(Результат.Error.additionalInfo.REASON);
		КонецЕсли;
		Если Результат.Свойство("requestId") Тогда 
			Сообщить(Результат.requestId);
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры
